# Topics: Bit Manipulation
class Solution:
    def reverseBits(self, n: int) -> int:
        res = 0
        for i in range(32):
            bit = (n >> i) & 1
            res = res | (bit << (31 - i))
        return res
        

s = Solution()
n = 5
print(s.reverseBits(n))



# Input: num (int) Output: num (int) reverse bit後的int
# Methods: 取得最右邊的bit，放到最左邊的bit
#                   num = 5
#       0000000000000000000000000000101
#       !.............................!     After reverse =>    res = 1010000000000000000000000000000
#        !...........................!
#         !.........................!
#                     類推...


#                   num >> (0 ~ 31)                               res
#       0000000000000000000000000000101            00000000000000000000000000000000
#     & 0000000000000000000000000000001          | 10000000000000000000000000000000     bit << (31 ~ 0)
#   --------------------------------------      --------------------------------------
#                   bit = 1                 =>     10000000000000000000000000000000
#
#
#
#